In [46]:
import  pandas as pd    
import  numpy  as  np

In [47]:
# import the dataset
df = pd.read_csv('Data/tn.movie_budgets.csv')
df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [48]:
# checking null values 
df.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [49]:
# removing duplicate rows
df = df.drop_duplicates()
df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"
...,...,...,...,...,...,...
5777,78,"Dec 31, 2018",Red 11,"$7,000",$0,$0
5778,79,"Apr 2, 1999",Following,"$6,000","$48,482","$240,495"
5779,80,"Jul 13, 2005",Return to the Land of Wonders,"$5,000","$1,338","$1,338"
5780,81,"Sep 29, 2015",A Plague So Pleasant,"$1,400",$0,$0
5781,82,"Aug 5, 2005",My Date With Drew,"$1,100","$181,041","$181,041"

In [50]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   object
 4   domestic_gross     5782 non-null   object
 5   worldwide_gross    5782 non-null   object
dtypes: int64(1), object(5)
memory usage: 271.2+ KB

In [51]:
df.isnull().sum()

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

In [52]:
# changing object to int
df['production_budget'] = df['production_budget'].str.replace('$','').str.replace(',','').astype(int)

In [53]:
# changing object to int
df['domestic_gross'] = df['domestic_gross'].str.replace('$','').str.replace(',','').astype(int)

In [61]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   object
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int32
 4   domestic_gross     5782 non-null   int32
 5   worldwide_gross    5782 non-null   object
dtypes: int32(2), int64(1), object(3)
memory usage: 226.0+ KB

In [64]:
# changing dates 
df['release_date'] = pd.to_datetime(df['release_date'])

In [66]:
# changing object to float
df['worldwide_gross'] = df['worldwide_gross'].str.replace('$','').str.replace(',','').astype(float)

In [67]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 5782 non-null   int64
 1   release_date       5782 non-null   datetime64[ns]
 2   movie              5782 non-null   object
 3   production_budget  5782 non-null   int32
 4   domestic_gross     5782 non-null   int32
 5   worldwide_gross    5782 non-null   float64
 6   domestic_profit    5782 non-null   int32
dtypes: datetime64[ns](1), float64(1), int32(3), int64(1), object(1)
memory usage: 248.6+ KB

In [69]:
df

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross,domestic_profit
0,1,2009-12-18,Avatar,425000000,760507625,2.776345e+09,335507625
1,2,2011-05-20,Pirates of the Caribbean: On Stranger Tides,410600000,241063875,1.045664e+09,-169536125
2,3,2019-06-07,Dark Phoenix,350000000,42762350,1.497624e+08,-307237650
3,4,2015-05-01,Avengers: Age of Ultron,330600000,459005868,1.403014e+09,128405868
4,5,2017-12-15,Star Wars Ep. VIII: The Last Jedi,317000000,620181382,1.316722e+09,303181382
...,...,...,...,...,...,...,...
5777,78,2018-12-31,Red 11,7000,0,0.000000e+00,-7000
5778,79,1999-04-02,Following,6000,48482,2.404950e+05,42482
5779,80,2005-07-13,Return to the Land of Wonders,5000,1338,1.338000e+03,-3662
5780,81,2015-09-29,A Plague So Pleasant,1400,0,0.000000e+00,-1400
5781,82,2005-08-05,My Date With Drew,1100,181041,1.810410e+05,179941

In [70]:
# cleaned data export
df.to_csv('Data/cleaned_movie_budgets.csv', index=False)